Бухгалтерские_задачи_по_методичке/src/Documents/ПКО/ПКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПКО</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.Бухгалтерский</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <comment>1</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_по_методичке/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_по_методичке/src/ChartsOfAccounts/Бухгалтерский/Бухгалтерский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Бухгалтерский</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>1</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>1.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>1.2</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>1.3</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>2</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>2.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>2.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>3</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ТоварыНаХранении</name>
      <description>Товары на хранении</description>
      <code>6</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_по_методичке/src/Documents/ПКО/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;

	Движение = Движения.Проводки.Добавить();

	Движение.СчетДт = ПланыСчетов.Бухгалтерский.Касса;

	Движение.ВалютаДт = Валюта;
	Движение.ВалютнаяСуммаДт = Сумма;

	Движение.СчетКт = Счет;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 1, Субконто1);
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 2, Субконто2);

	ДанныеСчета = БухгалтерияСерверПовторно.ПолучитьСвойствоСчета(Движение.СчетКт);

	Если (ДанныеСчета.Валютный = Истина) Тогда
		
		Движение.ВалютаКт = Валюта;
		Движение.ВалютнаяСуммаКт = Сумма;

	КонецЕсли;

	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	Движение.Организация = Организация;
	Движение.Сумма = БухгалтерияСервер.РассчитатьЭквивалент(Сумма, Валюта, Дата);
	Движение.Содержание = "Поступление денег";
	Движение.Период = Дата;

КонецПроцедуры
